# ============================================================================
# 2025. 07. 20.
# 빅데이터 저장시스템 개발

# 09_processing_system\config.py
#   - DB 접속정보 환경변수 설정
# =============================================================================

import os

# --------------------------------------------------------------------------
# DB 접속 URL 설정
#
# os.getenv('환경변수명', '기본값')
#   - 환경변수 HORSE_RACE_DB_URL이 설정되어 있으면 그 값을 사용
#   - 설정되어 있지 않으면 두번째 인자(기본값)을 사용
#
# URL 형식 : postgresql://[사용자계정]:[비밀번호]@[호스트]:[포트번호]/[DB이름]
# --------------------------------------------------------------------------
HORSE_RACE_DB_URL = os.getenv(
    "HORSE_RACE_DB_URL", 
    "postgresql://postgres:1234@localhost:5432/horse_race_db",
)
